{"keras_version": "2.1.6", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1, 48, 48], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 128, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"name": "conv2d_6", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 128, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"name": "conv2d_7", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"name": "conv2d_8", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last"}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 1}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"name": "conv2d_9", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"name": "conv2d_10", "dilation_rate": [1, 1], "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"name": "conv2d_11", "dilation_rate": [1, 1], "kernel_size": [1, 1], "filters": 2, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "padding": "same"}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"target_shape": [2, 2304], "trainable": true, "name": "reshape_1"}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "name": "permute_1", "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}}, {"inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "output_layers": [["activation_1", 0, 0]]}, "backend": "tensorflow"}